#include <iostream>
using namespace std;

//  строки в С++
//  строковый массив
//  Нуль терминатор


int main()
{
//-----------------------------------------------------------------------------------
   char symbol = 'G';
   cout << symbol << endl;
//-----------------------------------------------------------------------------------
   char  str [100] = "123456789";
   cout << str << endl;
   cout << strlen(str) << endl;
   cout << sizeof(str) << endl;
//-----------------------------------------------------------------------------------
   char    str2[100] = { 'r','t','o'};
   cout << str2 << endl;
   cout << strlen(str2) << endl;
   cout << sizeof(str2) << endl;
//-----------------------------------------------------------------------------------
  

    return 777;
}
